# Напишите программу, которая принимает от пользователя дату (день и месяц) и определяет, к какому времени года она относится. Выведите название сезона.
# Требования:
# Использовать операторы if-elif-else для определения сезона.
# Считайте, что:
# Весна: с 1 марта по 31 мая
# Лето: с 1 июня по 31 августа
# Осень: с 1 сентября по 30 ноября
# Зима: с 1 декабря по 28 февраля

# запрашиваем у пользователя дату
date = input("Введите дату в формате (день и месяц), например 1 марта: ")

# проверяем каждый элемент строки
for letter in date:
  # проверяем является ли элемент letter буквойБ если нет, то удаляем его из строки
  if not letter.isalpha():
    # удаляем элемент из строки
    date = date.replace(letter, "")

# проверяем есть ли такой месяц в строке, если есть выводим соответсвующий сезон
if date in "марта, апреля, мая":
  # если в строке есть название одного из месяцев весны, выводим слово весна
  print("Весна")
elif date in "июня, июля, августа":
  # если в строке есть название одного из месяцев лета, выводим слово лето
  print("Лето")
elif date in "сентября, октября, ноября":
  # если в строке есть название одного из месяцев осени, выводим слово осень
  print("Осень")
else:
  # если в строке нет названия ни одного из месяцев весны,осени или лета, выводим слово зима
  print("Зима")
